#### 📖 Terraform Plan -> deploy-kubernetes-infra

<details><summary>Clique para ver os detalhes</summary>

```terraform
Running plan in HCP Terraform. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/FIAP-SOAT-ORG/fiap-soat-cluster/runs/run-Wztamdhxqu4sRnPa

Waiting for the plan to start...

Terraform v1.14.0
on linux_amd64
Initializing plugins and modules...
data.terraform_remote_state.database: Refreshing...
module.eks.data.aws_caller_identity.current: Refreshing...
aws_ecr_repository.app_repo: Refreshing state... [id=fiap-soat-app]
module.eks.module.eks_managed_node_group["default"].data.aws_caller_identity.current: Refreshing...
module.eks.module.kms.data.aws_partition.current[0]: Refreshing...
module.eks.module.kms.data.aws_caller_identity.current[0]: Refreshing...
module.eks.data.aws_partition.current: Refreshing...
module.eks.module.eks_managed_node_group["default"].data.aws_partition.current: Refreshing...
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/fiap-soat-cluster/cluster]
module.eks.module.kms.data.aws_partition.current[0]: Refresh complete after 0s [id=aws]
module.eks.data.aws_partition.current: Refresh complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["default"].data.aws_partition.current: Refresh complete after 0s [id=aws]
module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Refreshing...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Refreshing...
module.eks.module.kms.data.aws_caller_identity.current[0]: Refresh complete after 0s [id=016804998405]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Refresh complete after 0s [id=2764486067]
module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Refresh complete after 0s [id=2560088296]
module.eks.module.eks_managed_node_group["default"].aws_iam_role.this[0]: Refreshing state... [id=default-eks-node-group-20260104175628349400000001]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=fiap-soat-cluster-cluster-20260104175628349700000003]
module.eks.data.aws_caller_identity.current: Refresh complete after 0s [id=016804998405]
module.eks.data.aws_iam_session_context.current: Refreshing...
module.eks.data.aws_iam_session_context.current: Refresh complete after 0s [id=arn:aws:iam::016804998405:user/github]
module.eks.module.eks_managed_node_group["default"].data.aws_caller_identity.current: Refresh complete after 0s [id=016804998405]
module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"]: Refreshing state... [id=default-eks-node-group-20260104175628349400000001-20260104175628880100000009]
module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=default-eks-node-group-20260104175628349400000001-20260104175628720100000006]
module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=default-eks-node-group-20260104175628349400000001-20260104175628659300000005]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=fiap-soat-cluster-cluster-20260104175628349700000003-20260104175628767800000007]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=fiap-soat-cluster-cluster-20260104175628349700000003-20260104175628768200000008]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Refreshing...
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Refresh complete after 0s [id=221977848]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=1200da81-f6f0-43ce-a9b7-cfaf18fbfea9]
module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/fiap-soat-cluster]
data.terraform_remote_state.database: Refresh complete after 0s
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::016804998405:policy/fiap-soat-cluster-cluster-ClusterEncryption2026010417565754120000000a]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-0e51efc3b3e43e888]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-0a54728ac89546961]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=fiap-soat-cluster-cluster-20260104175628349700000003-2026010417565776800000000b]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-264008153]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-3399645881]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-946368398]
module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-2463264884]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-2886210443]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-2173586517]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-1682144065]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-2002812465]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-3845095326]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-1536169954]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-1862130006]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=fiap-soat-cluster]
module.eks.aws_ec2_tag.cluster_primary_security_group["Environment"]: Refreshing state... [id=sg-0b694a5e844bc8cf5,Environment]
module.eks.aws_ec2_tag.cluster_primary_security_group["Project"]: Refreshing state... [id=sg-0b694a5e844bc8cf5,Project]
module.eks.data.tls_certificate.this[0]: Refreshing...
module.eks.time_sleep.this[0]: Refreshing state... [id=2026-01-04T21:02:29Z]
module.eks.data.tls_certificate.this[0]: Refresh complete after 0s [id=0c37bb608751c2a14704338d4b14c14e6dbe88ac]
module.eks.module.eks_managed_node_group["default"].aws_launch_template.this[0]: Refreshing state... [id=lt-0be75a6905ad4e486]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::016804998405:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/8D2AF317C991AD3F140942975FD4AA7E]
module.eks.module.eks_managed_node_group["default"].aws_eks_node_group.this[0]: Refreshing state... [id=fiap-soat-cluster:default-20260105013013567200000001]
╷
│ Warning: Deprecated Resource
│
│   with module.eks.kubernetes_config_map.aws_auth,
│   on .terraform/modules/eks/main.tf line 545, in resource "kubernetes_config_map" "aws_auth":
│  545: resource "kubernetes_config_map" "aws_auth" {
│
│ Deprecated; use kubernetes_config_map_v1.
╵
╷
│ Warning: Argument is deprecated
│
│   with module.eks.aws_iam_role.this[0],
│   on .terraform/modules/eks/main.tf line 293, in resource "aws_iam_role" "this":
│  293: resource "aws_iam_role" "this" {
│
│ inline_policy is deprecated. Use the aws_iam_role_policy resource instead.
│ If Terraform should exclusively manage all inline policy associations (the
│ current behavior of this argument), use the aws_iam_role_policies_exclusive
│ resource as well.
╵

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eks_addon.cloudwatch_observability will be created
  + resource "aws_eks_addon" "cloudwatch_observability" {
      + addon_name           = "amazon-cloudwatch-observability"
      + addon_version        = (known after apply)
      + arn                  = (known after apply)
      + cluster_name         = "fiap-soat-cluster"
      + configuration_values = (known after apply)
      + created_at           = (known after apply)
      + id                   = (known after apply)
      + modified_at          = (known after apply)
      + tags_all             = (known after apply)
    }

  # module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.additional["CloudWatchAgentServerPolicy"] will be created
  + resource "aws_iam_role_policy_attachment" "additional" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/CloudWatchAgentServerPolicy"
      + role       = "default-eks-node-group-20260104175628349400000001"
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pushed by: @GustaSchmidt, Action: `pull_request`*